BojanJurca/Esp32_oscilloscope/oscilloscope.h
              // ESP32 S3 board: https://docs.espressif.com/projects/esp-idf/en/v4.4/esp32s3/api-reference/peripherals/adc.html
              switch ((uint8_t) sharedMemory->gpio1) {
                  // ADC1
                  case  1: sharedMemory->adcchannel1 = ADC1_CHANNEL_0; break;
                  case  2: sharedMemory->adcchannel1 = ADC1_CHANNEL_1; break;
                  case  3: sharedMemory->adcchannel1 = ADC1_CHANNEL_2; break;
                  case  4: sharedMemory->adcchannel1 = ADC1_CHANNEL_3; break;
                  case  5: sharedMemory->adcchannel1 = ADC1_CHANNEL_4; break;
                  case  6: sharedMemory->adcchannel1 = ADC1_CHANNEL_5; break;
                  case  7: sharedMemory->adcchannel1 = ADC1_CHANNEL_6; break;
                  case  8: sharedMemory->adcchannel1 = ADC1_CHANNEL_7; break;
                  case  9: sharedMemory->adcchannel1 = ADC1_CHANNEL_8; break;
                  case 10: sharedMemory->adcchannel1 = ADC1_CHANNEL_9; break;
                  // ADC2 (GPIOs 11, 12, 13, 14, 15, 16, 17, 18, 19, 20), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSck->sendString (Cstring<64> ("[oscilloscope] can't analogRead GPIO ") + Cstring<64> (sharedMemory->gpio1) + "."); // send error also to javascript client
                            free (sharedMemory);
                            return;
              }
              switch ((uint8_t) sharedMemory->gpio2) {
                  // ADC1
                  case  1: sharedMemory->adcchannel2 = ADC1_CHANNEL_0; break;
                  case  2: sharedMemory->adcchannel2 = ADC1_CHANNEL_1; break;
                  case  3: sharedMemory->adcchannel2 = ADC1_CHANNEL_2; break;
                  case  4: sharedMemory->adcchannel2 = ADC1_CHANNEL_3; break;
                  case  5: sharedMemory->adcchannel2 = ADC1_CHANNEL_4; break;
                  case  6: sharedMemory->adcchannel2 = ADC1_CHANNEL_5; break;
                  case  7: sharedMemory->adcchannel2 = ADC1_CHANNEL_6; break;
                  case  8: sharedMemory->adcchannel2 = ADC1_CHANNEL_7; break;
                  case  9: sharedMemory->adcchannel2 = ADC1_CHANNEL_8; break;
                  case 10: sharedMemory->adcchannel2 = ADC1_CHANNEL_9; break;
                  // not used
                  case 255: break;
                  // ADC2 (GPIOs 11, 12, 13, 14, 15, 16, 17, 18, 19, 20), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSck->sendString (Cstring<64> ("[oscilloscope] can't analogRead GPIO ") + Cstring<64> (sharedMemory->gpio2) + "."); // send error also to javascript client
                            free (sharedMemory);
                            return;
              }

          #elif CONFIG_IDF_TARGET_ESP32C3
              __oscilloscope_h_debug__ ("MCU ESP32C3 pinout");

              // ESP32 C3 board: https://docs.espressif.com/projects/esp-idf/en/latest/esp32c3/hw-reference/esp32c3/user-guide-devkitm-1.html
              switch ((uint8_t) sharedMemory->gpio1) {
                  // ADC1
                  case  0: sharedMemory->adcchannel1 = ADC1_CHANNEL_0; break;
                  case  1: sharedMemory->adcchannel1 = ADC1_CHANNEL_1; break;
                  case  2: sharedMemory->adcchannel1 = ADC1_CHANNEL_2; break;
                  case  3: sharedMemory->adcchannel1 = ADC1_CHANNEL_3; break;
                  case  4: sharedMemory->adcchannel1 = ADC1_CHANNEL_4; break;
                  // ADC2 (GPIO 5), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSck->sendString (Cstring<64> ("[oscilloscope] can't analogRead GPIO ") + Cstring<64> (sharedMemory->gpio1) + "."); // send error also to javascript client
                            free (sharedMemory);
                            return;
              }
              switch ((uint8_t) sharedMemory->gpio2) {
                  // ADC1
                  case  0: sharedMemory->adcchannel2 = ADC1_CHANNEL_0; break;
                  case  1: sharedMemory->adcchannel2 = ADC1_CHANNEL_1; break;
                  case  2: sharedMemory->adcchannel2 = ADC1_CHANNEL_2; break;
                  case  3: sharedMemory->adcchannel2 = ADC1_CHANNEL_3; break;
                  case  4: sharedMemory->adcchannel2 = ADC1_CHANNEL_4; break;
                  // not used
                  case 255: break;
                  // ADC2 (GPIO 5), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSck->sendString (Cstring<64> ("[oscilloscope] can't analogRead GPIO ") + Cstring<64> (sharedMemory->gpio2) + "."); // send error also to javascript client
                            free (sharedMemory);
                            return;
              }

          #elif CONFIG_IDF_TARGET_ESP32C6
              // ESP32 C6 board: https://docs.espressif.com/projects/esp-idf/en/stable/esp32c6/api-reference/peripherals/gpio.html
              switch ((uint8_t) sharedMemory->gpio1) {
                  // ADC1
                  case  0: sharedMemory->adcchannel1 = ADC1_CHANNEL_0; break;
                  case  1: sharedMemory->adcchannel1 = ADC1_CHANNEL_1; break;
                  case  2: sharedMemory->adcchannel1 = ADC1_CHANNEL_2; break;
                  case  3: sharedMemory->adcchannel1 = ADC1_CHANNEL_3; break;
                  case  4: sharedMemory->adcchannel1 = ADC1_CHANNEL_4; break;
                  case  5: sharedMemory->adcchannel1 = ADC1_CHANNEL_5; break;
                  case  6: sharedMemory->adcchannel1 = ADC1_CHANNEL_6; break;
                  // ESP32 C5 does not have ADC2
                  default:  webSck->sendString (Cstring<64> ("[oscilloscope] can't analogRead GPIO ") + Cstring<64> (sharedMemory->gpio1) + "."); // send error also to javascript client
                            free (sharedMemory);
                            return;
              }
              switch ((uint8_t) sharedMemory->gpio2) {
                  // ADC1
                  case  0: sharedMemory->adcchannel2 = ADC1_CHANNEL_0; break;
                  case  1: sharedMemory->adcchannel2 = ADC1_CHANNEL_1; break;
                  case  2: sharedMemory->adcchannel2 = ADC1_CHANNEL_2; break;
                  case  3: sharedMemory->adcchannel2 = ADC1_CHANNEL_3; break;
                  case  4: sharedMemory->adcchannel2 = ADC1_CHANNEL_4; break;
                  case  5: sharedMemory->adcchannel2 = ADC1_CHANNEL_5; break;
                  case  6: sharedMemory->adcchannel2 = ADC1_CHANNEL_6; break;
                  // not used
                  case 255: break;
                  // ESP32 C5 does not have ADC2
                  default:  webSck->sendString (Cstring<64> ("[oscilloscope] can't analogRead GPIO ") + Cstring<64> (sharedMemory->gpio2) + "."); // send error also to javascript client
                            free (sharedMemory);
                            return;
              }

          // #elif CONFIG_IDF_TARGET_ESP32H2
            
          #else
              #error "Your board (CONFIG_IDF_TARGET) is not supported by oscilloscope.h"
          #endif

