BojanJurca/Esp32_oscilloscope/oscilloscope.h
      }
      
      // parse 2nd part
      if (!cmdPart2) {
        // cout << ( dmesgQueue << "[oscilloscope] oscilloscope protocol syntax error" );
        webSck->sendString ("[oscilloscope] oscilloscope protocol syntax error"); // send error also to javascript client
        free (sharedMemory);    
        return;
      }
      if (sscanf (cmdPart2, "every %i %2s screen width = %lu %2s", &sharedMemory->samplingTime, sharedMemory->samplingTimeUnit, &sharedMemory->screenWidthTime, sharedMemory->screenWidthTimeUnit) != 4) {
        // cout << ( dmesgQueue << "[oscilloscope] oscilloscope protocol syntax error" );
        webSck->sendString ("[oscilloscope] oscilloscope protocol syntax error"); // send error also to javascript client
        free (sharedMemory);
        return;
      }
          
      // parse 3rd part
      if (cmdPart3) { 
        switch (sscanf (cmdPart3, "set %8s slope trigger to %i set %8s slope trigger to %i", posNeg1, &treshold1, posNeg2, &treshold2)) {
          case 0: // no trigger
                  break;
          case 4: // two triggers
                  if (!strcmp (posNeg2, "positive")) {
                    sharedMemory->positiveTrigger = true;
                    sharedMemory->positiveTriggerTreshold = treshold2;
                  }
                  if (!strcmp (posNeg2, "negative")) {
                    sharedMemory->negativeTrigger = true;
                    sharedMemory->negativeTriggerTreshold = treshold2;
                  }    
                  // don't break, continue to the next case
                  [[fallthrough]];
          case 2: // one trigger
                  if (!strcmp (posNeg1, "positive")) {
                    sharedMemory->positiveTrigger = true;
                    sharedMemory->positiveTriggerTreshold = treshold1;
                  }
                  if (!strcmp (posNeg1, "negative")) {
                    sharedMemory->negativeTrigger = true;
                    sharedMemory->negativeTriggerTreshold = treshold1;
                  }
                  break;
          default:
                    // cout << ( dmesgQueue << "[oscilloscope] oscilloscope protocol syntax error" );
                    webSck->sendString ("[oscilloscope] oscilloscope protocol syntax error"); // send error also to javascript client
                    free (sharedMemory);
                    return;
        }
      }

      // check the values and calculate derived values
      if (!(!strcmp (sharedMemory->readType, "analog") || !strcmp (sharedMemory->readType, "digital"))) {
        // cout << ( dmesgQueue << "[oscilloscope] wrong readType - read type can only be analog or digital" );
        webSck->sendString ("[oscilloscope] wrong readType -read type can only be analog or digital"); // send error also to javascript client
        free (sharedMemory);
        return;
      }
      if (sharedMemory->gpio1 < 0 || sharedMemory->gpio2 < 0) {
        // cout << ( dmesgQueue << "[oscilloscope] invalid GPIO" );
        webSck->sendString ("[oscilloscope] invalid GPIO"); // send error also to javascript client
        free (sharedMemory);
        return; 
      }
      if (!(sharedMemory->samplingTime >= 1 && sharedMemory->samplingTime <= 25000)) {
        // cout << ( dmesgQueue << "[oscilloscope] invalid sampling time. Sampling time must be between 1 and 25000" );
        webSck->sendString ("[oscilloscope] invalid sampling time. Sampling time must be between 1 and 25000"); // send error also to javascript client
        free (sharedMemory);
        return;
      }
      if (strcmp (sharedMemory->samplingTimeUnit, "ms") && strcmp (sharedMemory->samplingTimeUnit, "us")) {
        // cout << ( dmesgQueue << "[oscilloscope] wrong samplingTimeUnit. Sampling time unit can only be ms or us" );
        webSck->sendString ("[oscilloscope] wrong samplingTimeUnit. Sampling time unit can only be ms or us"); // send error also to javascript client
        free (sharedMemory);
        return;
      }

      if (strcmp (sharedMemory->screenWidthTimeUnit, sharedMemory->samplingTimeUnit)) {
        // cout << ( dmesgQueue << "[oscilloscope] screenWidthTimeUnit must be the same as samplingTimeUnit" );
        webSck->sendString ("[oscilloscope] screenWidthTimeUnit must be the same as samplingTimeUnit"); // send error also to javascript client
        free (sharedMemory);
        return;
      }

      if (sharedMemory->positiveTrigger) {
        if (sharedMemory->positiveTriggerTreshold > 0 && sharedMemory->positiveTriggerTreshold <= (strcmp (sharedMemory->readType, "analog") ? 1 : 4095)) {
          ;// Serial.printf ("[oscilloscope] positive slope trigger treshold = %i\n", sharedMemory->positiveTriggerTreshold);
        } else {
            // cout << ( dmesgQueue << "[oscilloscope] invalid positive slope trigger treshold (according to other settings)" );
            webSck->sendString ("[oscilloscope] invalid positive slope trigger treshold (according to other settings)"); // send error also to javascript client
            free (sharedMemory);
            return;
        }
      }
      if (sharedMemory->negativeTrigger) {
        if (sharedMemory->negativeTriggerTreshold >= 0 && sharedMemory->negativeTriggerTreshold < (strcmp (sharedMemory->readType, "analog") ? 1 : 4095)) {
          ;//Serial.printf ("[oscilloscope] negative slope trigger treshold = %i\n", sharedMemory->negativeTriggerTreshold);
        } else {
            // cout << ( dmesgQueue << "[oscilloscope] invalid negative slope trigger treshold (according to other settings)" );
            webSck->sendString ("[oscilloscope] invalid negative slope trigger treshold (according to other settings)"); // send error also to javascript client
            free (sharedMemory);
            return;
        }
      }

      // choose the corect oscReader
      void (*oscReader) (void *sharedMemory);
      if (strcmp (sharedMemory->readType, "analog")) {
          oscReader = oscReader_digital; // us sampling interval, 1-2 signals, digital reader
      } else {
          oscReader = oscReader_analog; // us sampling interval, 1-2 signals, analog reader
          #ifdef USE_I2S_INTERFACE
            if (sharedMemory->gpio2 > 39 && sharedMemory->samplingTime <= 1000) // 1 signal only, sampling time is short enough
                oscReader = oscReader_analog_1_signal_i2s; // us sampling interval, 1 signal, (fast, DMA) I2S analog reader
          #endif
      }
      if (!strcmp (sharedMemory->samplingTimeUnit, "ms")) {
          oscReader = oscReader_millis; // ms sampling intervl, 1-2 signals, digital or analog reader with 'sample at a time' or 'screen at a time' options
      }

      sharedMemory->oscReaderState = INITIAL;

      BaseType_t taskCreated = xTaskCreate (oscReader, "oscReader", 4 * 1024, (void *) sharedMemory, OSCILLOSCOPE_READER_PRIORITY, NULL);
      if (pdPASS != taskCreated) {
            // cout << ( dmesgQueue << "[oscilloscope] could not start oscReader" );
            webSck->sendString ("[oscilloscope] could not start oscReader"); // send error also to javascript client
      } else {

                // send oscReader START signal and wait until STARTED
                sharedMemory->oscReaderState = START; 
                while (sharedMemory->oscReaderState == START) delay (1); 

        // start oscilloscope sender in this thread

        oscSender ((void *) sharedMemory); 
        // stop reader - we can not simply vTaskDelete (oscReaderHandle) since this could happen in the middle of analogRead which would leave its internal semaphore locked

                // send oscReader STOP signal
                sharedMemory->oscReaderState = STOP; 

                // wait until oscReader STOPPED or error
                while (sharedMemory->oscReaderState != STOPPED) delay (1); 
      }

      free (sharedMemory);
      return;
    }

#endif